/**
 * AUTHORS:
 *
 * M_Shirani
 *
 */

import config from "build/config/config";

export default {

    global:{
        webWallet: "کیف پول تحت وب",
        explorer: `جستجوگر بلوک`,
        faq: `سوالات متداول`,
    },

    pages:{

        homepage:{

            title: "اولین صرافی ناشناس در جهان",
            subTitle: "پرداخت ناشناس، برای اشخاص عادی هم آسان شده است.",
            blocks: 'بلوک ها',
            transactions: 'تراکنش ها',
            uniqueAccounts: 'حساب های منحصر به فرد',
            realTimeDataFrom: 'داده بلادرنگ از',
            testNetBlockchainExplorer: 'جستجوگر بلاکچین شبکه آزمایشی',

            anonymousCashForTheInternet: 'پول ناشناس برای اینترنت',
            worldsFirstAnonymousDecentralizedExchange: "اولین صرافی غیرمتمرکز و ناشناس دنیا",
            itsFastPrivateAndSecure: `سريع، خصوصي و امن است. با ${config.app.name}، شما بانك خود هستيد. شما مي توانيد كاملا ناشناس، پول را به به هركس كه بشناسيد بفرستيد و ديگران توانايي رويت دارايي شما يا دنبال كردن فعاليتتان را نخواهند داشت.`,

            getPaidAnonymously: 'به طور ناشناس پول بگیرید',
            itsUntraceable: "این غیر قابل ردیابی است.",
            sendingReceivingAddressesObfuscated: `فرستادن و دريافت آدرس ها به همراه مقادير تراكنش شده به طور پيش فرض نامشخص است. تراكنش ها روي ${config.app.name}  نمي تواند به كاربر يا هويت واقعي فرد ارتباط داده شود. `,

            privateDigitalCurrency: "ارز دیجیتال خصوصی",
            withASingleClick: "تنها با یک کلیک",
            neverBeenEasierToSendAndReceiveMoney: "در هیچ زمانی دریافت و ارسال پول به صورت ناشناس و غیرقابل ردیابی در سطح بین المللی تا به این حد ساده نبوده است.",

            youAreYourOwnBank: `شما بانک خود هستید`,
            withNameYouAreYourOwnBank: `با ${config.app.name}، شما بانك خود هستيد و ديگران نمي توانند موجودي يا فعاليت شما را دنبال كنند. به ${config.app.name}. سلام كنيد. `,
            nameIsSecure: `${config.app.name}  امن است `,
            unstoppableByUsingDecentralizedBlockchain: `به واسطه تكنولوژي بلاكچين تمركززدايي شده كه توسط كاربران شبكه حفظ مي شود غير قابل توقف است.
            nameIsPrivate: `${config.app.name}  خصوصي است `,
            youOwnYourOwnKey: `شما مالک کلید شخصی خود هستید و هیچکس قادر نیست شما را ردیابی کند.`,

            anonymousPaymentsMadeEasy: `پرداخت های ناشناس آسان شده است.`,

            features:{

                makeItPerfect:`برای شما کامل و بی نقص شده!`,
                worldFirstAnonymousExchange:`اولین صرافی تمرکززدایی شده ناشناس و غیرقابل ردیابی در جهان`,

                private: `خصوصی`,
                privateZether: `مكانيزم جديد رمزنگاري زتر كه از  استفاده مي كند مبداها، مقادير و مقاصد همه تراكنش ها را ناشناس مي كند.`,

                untraceable: `غیر قابل ردیابی`,
                obfuscated: `آدرس هاي فرستنده و گيرنده شامل مقادير تراكنش شده به صورت پيشفرض نامشخص مي شوند.`,

                fungible: `پایاپا`,
                noBlacklist: `واحدهاي ${config.app.name} نمي تواند به وسيله وندورها يا صرافي ها به واسطه ارتباط با تراكنش هاي قبلي به ليست سياه اضافه شود. `,

                assetPlusCurrency: `دارایی ها و ارزها`,
                assetPlusCurrencyAnchor: `.دارايي هاي ديجيتال و ارزهايي كه ارزش دارايي هاي ديگر را كه توسط جامعه حمايت مي شوند را نگه مي دارند`,

                confidentialBlindedEscrow: `سند تضميني محرمانه و كور`,
                completelyBlindEscrow: `.سندهاي تضميني، مقدار، فرستنده واقعي و مقصد واقعي را نمي دانند. سندهاي تضميني كاملا كور شده اند`,

                reviewsForTraders: `نقدهایی برای معامله گران`,
                reviewsForTradersAnonymous: `برای افزایش اعتماد بین معامله گران در شبکه، نقدهای ناشناس می تواند نوشته شود.`,

                encryptedChat: `گفتگوی رمزنگاری شده`,
                encryptedChatEndToEnd: `بين معامله گران و سند تضميني كور شده، سر به سر رمزنگاري شده است. ${config.app.name} چت در`,

                noDeposit: `بدون واریز`,
                noDepositNoCoins: `${config.app.name}  اولين صرافي تمركززدايي شده p2p است كه به كاربران اجازه مي دهد كه بدون نياز به واريز يا داشتن سكه ها معامله كنند. براي خريد سكه ها يا دارايي ها، شما نياز به مالكيت سكه ها نداريد. `,

                instantAnonymity: `کیف پول فوری، بی نام و اچ دی`,
                advancedHdWallet: `رمزگشايي و مشاهده دارايي ها و تراكنش هاي شما، تنها چند ثانيه زمان مي برد. علاوه بر اين يك كيف پول HD اجرايي شده است.  `,

            },


            finished:{

                timeline: `ترتیب زمانی برای شبکه اصلی پاندورا پی`,
                launchTimeline: ` جدول زماني براي شروع به كار پاندورا پي. ما نمي خواهيم زمان خاصي را پيشنهاد دهيم اما بخش اعظم كد اجرايي شده است.`,

                dataStructure: `ساختار داده ها`,
                networking: `شبکه`,
                cryptoAndRingCT: `كريپتو و RingCT – امضاهاي محرمانه حلقه  `,
                blockchainAndConsensus: `بلاکچین و اجماع`,
                exchangeFiftyPerCent: `صرافی - 50%`,
                encryptedMessages: `پیام های رمزنگاری شده`,
                completelyBlindedEscrow: `سند تضمين كاملا كور شده`,
                finalTests: `تست های نهایی`,

            },


            gotAQuestion: `سوالی برایتان پیش آمده؟ ما جواب آن را داریم`,
        },

        contact:{
            people: `مردم`,
            peopleMeetTheCommunity: `دیدار با ما`,

            team: `تیم کوچک ما را که آن محصولات بزرگ را ساخته ملاقات کنید.`,
            teamAlexandruIonutBudisteanu: `الكساندرو يونات باديستينو `,
            teamFounder: `موسس`,
            teamFounderAchievements: `الكساندرو يكي از نفرات منتخب زير 30 ساله فوربس 30 اروپا در شاخه صنعت است. در سال 2013، او توسط مجله تايم به عنوان يكي از تاثيرگذارترين نوجوانان جهان انتخاب شد. MIT يكي از شهاب سنگ ها را به نام او نامگذاري نموده است. `,

            contactTheCommunity: `تماس`,
            letsTalk: `بیایید صحبت کنیم`,
            waysToContact: `در صورت داشتن سوال، اینها راه های ارتباطی با ما هستند.`,

            messageReceivedWaitNow: `ما پیامتان را دریافت کردیم و به زودی با شما تماس خواهیم گرفت`,
            inputYourName: `نام شما`,
            inputYourEmail: `ایمیل شما`,
            inputYourMessage: `پیام`,
            send: `فرستادن`,
        },

        faq:{
            weGotAnswers: `سوالات متداول`,
            weGotAllTheAnswers: `سوالی دارید؟ ما اینجاییم تا به سوالاتتان پاسخ دهیم!`,

            questionTypeOfPaymentAccepted: `چه پرداخت هایی پذیرفته می شود؟`,
            answerTypeOfPaymentAccepted: `همه پرداخت ها به جز پرداخت هايي كه به راحتي بازپرداخت را براي كلاهبرداري  از فروشندگان ارائه مي دهند پذيرفته مي شوند. ... محدود نشده است و كاربران مي توانند روش هاي پرداخت خود شامل: چهره به چهره، انتقال بانكي ملي/جهاني، سپا، علي پي، وي چت پي، ريولوت، بيتكوين، اتريوم، وبدلار وغيره را تعريف كنند. بعضي از پرداخت ها كه بازپرداخت ساده را تسهيل مي كنند براي خريداران با رتبه پايين توصيه نمي شود. يكي از اين روش هاي بازپرداخت پي پال است. چرا كه بازپرداخت با اين ادعا كه شما محصولات را دريافت ننموده ايد آسان مي باشد.  `,

            questionPeerToPeerExchange: `صرافی همتا به همتا چگونه کار می کند؟ `,
            answerPeerToPeerExchange: `معامله زماني رخ مي دهد كه خريداري مقداري سكه/توكن از فروشنده دريافت كند. فروشنده اي كه معامله اي را باز مي كند مقداري دارايي (توكن) به فروش مي رساند و خريدار براي تصاحب اين دارايي ها (توكن ها) به صورت خارج از زنجيره پرداخت مي كند. بعد از اين كه پرداخت خارج از زنجيره خريدار، نهايي و تاييد شد خريدار دارايي ها (توكن ها) را از خريدار دريافت مي دارد.  `,

            questionIsBuyerProtected: `خريدار چگونه در ${config.app.name}  حفاظت مي شود؟ `,
            answerIsBuyerProtected: `فروشنده اي كه مالك دارايي هاست و تمايل به فروش آن ها در صرافي دارد بايد به صورت ناشناس دارايي ها را در يك حساب معاملاتي ويژه، كه هنوز تحت مالكيت اوست، واريز نمايد. آن گاه فروشنده يك سند تضميني تضميني كور شده در اين حساب معاملاتي، براي نظارت بر معامله تنظيم مي كند. حالا فروشنده نمي تواند منابع را از حساب معاملاتي بدون اجازه سند تضميني حركت دهد. در مواقعي كه مشاجره اي اتفاق بيفتد، خريدار مي تواند شكايت كند و اثبات كند كه منابعي را براي فروشنده فرستاده، اما فروشنده به خواست خود منابع مورد نظر را ارسال نكرده است.  `,

            questionCompletelyBlindedEscrow: `يك سند تضميني كاملا كور شده چيست؟`,
            answerCompletelyBlindedEscrow: `يك سند تضميني كاملا كور شده مقدار معامله شده، آدرس فرستنده واقعي و آدرس گيرنده واقعي را نمي داند. همچنين قدرت كافي براي حركت دادن منابع را به خودي خود ندارد و تنها براي اطمينان يافتن از انتقال نيافتن منابع معهود توسط خريدار به فروشنده استفاده مي شود. `,

            questionIsTradeChatEncrypted: `آیا گفتگوها در معاملات رمزنگاری شده است؟`,
            answerIsTradeChatEncrypted: `بله! همه پيام ها در گفتگو به صورت peer-to-peer با استفاده از عملگرهاي رمزنگاري به نام ECIES - Elliptic Curve Integrated Encryption Scheme رمزنگاري شده اند. `,

            questionAddressNeedToKnowOnly: `آيا خريدار، فروشنده و حساب تضمين، آدرس يكديگر را خواهند دانست؟`,
            answerAddressNeedToKnowOnly: `خير! خريدار آدرس فروشنده را نخواهد دانست. فروشنده نيز آدرس خريدار را نخواهد فهميد. سند تضميني، از آدرس واقعي خريدار يا فروشنده و مقدار تراكنش شده آگاهي نخواهد يافت. `,

            questionProofOwnerFunds: `چگونه خریدار بداند که فروشنده سرمایه های معهود را داراست؟`,
            answerProofOwnerFunds: `اگر آن ها بر سر قيمت توافق كنند، خريدار به صورت اتوماتيك يك مدرك از فروشنده درخواست مي كند تا او منابع كافي براي معامله را دارا باشد. فروشنده مدركي دال بر دارا بودن منابع كافي براي معامله توليد خواهد كرد. `,

            questionCanWeTradeAnything: `چه دارایی ها یا توکن هایی می تواند معامله شود؟`,
            answerCanWeTradeAnything: `هر دارايي در جهان واقعي مي تواند به صورت يك دارايي ديجيتال توكنايز شود. مي تواند به وسيله دارايي/كريپتو وثيقه شود يا از وثيقه خارج شود. `,

            questionRingSignatureUntraceable: `چگونه در ${config.app.name}  دارايي ها/ توكن ها غير قابل رهگيري مي شوند؟ `,
            answerRingSignatureUntraceable: ` ${config.app.name}  از امضاهاي حلقه محرمانه (مانند مونرو) استفاده مي كند به اين معنا كه مقادير پنهان (محرمانه) هستند و يك تراكنش از تله هاي تصادفي از شبكه (يك حلقه تراكنش) استفاده مي كند. `,
        },

        404:{
            notFound: '404 - صفحه مورد نظر پیدا نشد'
        },

        tos:{
            tos: "شرایط استفاده از خدمات",
            description: " لطفا شرایط استفاده از خدمات را بخوانید (\" شرایط\", \" شرایط استفاده از خدمات\") با دقت قبل از استفاده از پاندورا پی که توسط یک شبکه غیرمتمرکز همتا به همتا اداره می شود. \n" +
            "\n" +
            "دسترسی و استفاده شما از این سرویس منوط به موافقت شما با این شرایط است. این شرایط به همه بازدیدکنندگان، کاربران و سایر افرادی که از سرویس استفاده می کنند اعمال می شود."
        }

    },

    layout:{

        navbar:{
            logoAlt: `${config.app.name}`,

            home: `خانه`,
            contact: `تماس`,
        },

        footer:{

            organization: "سازمان",
            aboutUs: "درباره",
            contact: "تماس",

            blockchain: "بلاکچین",
            whyUs:`چرا ${config.app.name}?`,
            security: "امنیت",
            termsAndConditions: "شرایط و مقررات",

            community: "جامعه",
            github: "گیت هاب",
            telegram: "تلگرام",

            support: "پشتیبانی",
            helpCenter: "مرکز پشتیبانی",
            guides: "راهنما",
            api: "API",

            footer: `© 2020 ${config.app.name}. این یک پروژه متن باز تهیه شده توسط جامعه است.`

        },

    }



}
